configuration/src/Reports/ПроектыПоСпециалисту/ПроектыПоСпециалисту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПроектыПоСпециалисту</name>
</mdclass:Report>

configuration/src/Catalogs/СтатусыОбъектов/СтатусыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыОбъектов</name>
  <comment>Хранит  элементы, соответствующие определенным статусам объектов.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CodeReview</name>
      <description>Code review</description>
    </items>
    <items>
      <name>DesignReview</name>
      <description>Design review</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ВРеализацию</name>
      <description>В реализацию</description>
    </items>
    <items>
      <name>Внедрение</name>
      <description>Внедрение</description>
    </items>
    <items>
      <name>ВнутреннееТестирование</name>
      <description>Внутреннее тестирование</description>
    </items>
    <items>
      <name>Документирование</name>
      <description>Документирование</description>
    </items>
    <items>
      <name>ЗапросТребований</name>
      <description>Запрос требований</description>
    </items>
    <items>
      <name>Масштабирование</name>
      <description>Масштабирование</description>
    </items>
    <items>
      <name>НаДоработку</name>
      <description>На доработку</description>
    </items>
    <items>
      <name>Рассмотрение</name>
      <description>На рассмотрении</description>
    </items>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отклонен</name>
      <description>Отклонен</description>
    </items>
    <items>
      <name>Отложен</name>
      <description>Отложен</description>
    </items>
    <items>
      <name>Приостановлен</name>
      <description>Приостановлен</description>
    </items>
    <items>
      <name>Проработка</name>
      <description>Проработка</description>
    </items>
    <items>
      <name>Протестирован</name>
      <description>Протестирован</description>
    </items>
    <items>
      <name>Публикация</name>
      <description>Публикация</description>
    </items>
    <items>
      <name>Рассмотрен</name>
      <description>Рассмотрен</description>
    </items>
    <items>
      <name>РевьюТребований</name>
      <description>Ревью требований</description>
    </items>
    <items>
      <name>Решен</name>
      <description>Решен</description>
    </items>
    <items>
      <name>Тестирование</name>
      <description>Тестирование</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЗафиксирован</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс изображения в общей картинке СтатусыОбъектов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядковый номер статуса</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПричиныИзмененияСтатуса</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныИзмененияСтатусов</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Reports/ПроектыПоСпециалисту/Forms/НастройкиТаблиц/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрыСведений.ОтслеживаниеИспользованияФункциональности.ОткрытиеФормы(ЭтотОбъект.ИмяФормы);
	
	ЗаполнитьНастройкиКолонок(Колонки, Параметры.НастройкиКолонок, Параметры.Колонки);
	
	Если Параметры.Свойство("ВыбранныеСтатусы") Тогда
		ЗаполнитьСписокСтатусов(Параметры.ВыбранныеСтатусы);
	Иначе
		Элементы.СтраницаСтатусы.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд


&НаКлиенте
Процедура НастройкиКолонокПоУмолчанию(Команда)
	
	Колонки = НастройкиКолонокПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	НастройкиСписка = Новый Структура;  
	НастройкиСписка.Вставить("НастройкиКолонок", Колонки);

	Если Элементы.СтраницаСтатусы.Видимость Тогда
		ВыбранныеСтатусы = ПолучитьВыбранные(Статусы);
		НастройкиСписка.Вставить("ВыбранныеСтатусы", ВыбранныеСтатусы);
	КонецЕсли;
	
	Закрыть(НастройкиСписка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиКолонок(СписокКолонок, Знач СохраненныеНастройки, Знач ТекущиеНастройки)
	
	НастройкиКолонокПоУмолчанию = ТекущиеНастройки.Скопировать();
	
	Если СохраненныеНастройки <> Неопределено Тогда
		Для Каждого Колонка Из СохраненныеНастройки Цикл
			ЭлементСписка = ТекущиеНастройки.НайтиПоЗначению(Колонка.Значение);
			
			Если ЭлементСписка <> Неопределено Тогда
				НоваяКолонка = СписокКолонок.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, Колонка.Пометка);
				ТекущиеНастройки.Удалить(ЭлементСписка);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Колонка Из ТекущиеНастройки Цикл
			ЗаполнитьЗначенияСвойств(СписокКолонок.Добавить(), Колонка);
		КонецЦикла;
	Иначе
		СписокКолонок = ТекущиеНастройки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтатусов(ВыбранныеСтатусы)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СтатусыОбъектов.Ссылка КАК Значение,
	|	ВЫБОР
	|		КОГДА СтатусыОбъектов.Ссылка В (&ВыбранныеСтатусы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка,
	|	СтатусыОбъектов.Наименование КАК Представление,
	|	СтатусыОбъектов.ИндексКартинки КАК ИндексКартинки
	|ИЗ
	|	Справочник.СтатусыОбъектов КАК СтатусыОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтатусыОбъектов.Порядок";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВыбранныеСтатусы", ВыбранныеСтатусы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Статусы.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВыбранные(Список, Знач ПолучитьСписок = Ложь)
	
	Если ПолучитьСписок Тогда
		ВыбранныеЗначения = Новый СписокЗначений;
	Иначе
		ВыбранныеЗначения = Новый Массив;
	КонецЕсли; 
	
	Для Каждого Строка Из Список Цикл
		Если ПолучитьСписок Тогда
			ЗаполнитьЗначенияСвойств(ВыбранныеЗначения.Добавить(), Строка);
		ИначеЕсли Строка.Пометка Тогда
			ВыбранныеЗначения.Добавить(Строка.Значение);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ВыбранныеЗначения;
	
КонецФункции

#КонецОбласти
